#+title: Using Pandas
#+property: header-args:jupyter-python :exports both :cache yes :session pandas :results raw drawer 
#+startup: inlineimages

#+begin_src jupyter-python
import argparse
import random
import re
import math
import matplotlib.pyplot as plt
import mogutda
import networkx as nx
import pandas as pd
from pycliques.simplicial import clique_complex, nerve_of_sets
from pycliques.dominated import completely_pared_graph as p
from pycliques.dominated import (
    has_dominated_vertex,
    complete_s_collapse,
    complete_s_collapse_edges
    )
from pycliques.cliques import clique_graph as k
from pycliques.cliques import Clique
from pycliques.helly import is_clique_helly
from pycliques.lists import list_graphs
from pycliques.surfaces import open_neighborhood

from homsmall import *

def plot_neighborhoods(g):
    n = g.order()
    for i in range(n):
        rows = int(math.sqrt(n))
        columns = math.ceil(n/rows)
        plt.subplot(rows, columns, i+1)
        plt.title(i)
        nx.draw(open_neighborhood(g, i), node_size=200, with_labels='True')
    plt.show()
#+end_src

#+RESULTS[064539307cd15f96c7fd2b7f68b6b6b1e36ccc9c]:

#+begin_src jupyter-python
df = pd.read_csv('table.csv')
print(df)
#+end_src

#+RESULTS[d966361a4a15c8fb6c95dad512c830222a13d166]:
#+begin_example
    index  order  max d  Helly  K Helly                         HT G  \
0    3962      8      6  False    False  \(\vee_{2}S^{1}\vee S^{2}\)   
1    4046      8      5  False    False            \(\vee_{2}S^{1}\)   
2    4204      8      5  False    False            \(\vee_{2}S^{1}\)   
3    4288      8      5  False    False            \(\vee_{2}S^{1}\)   
4    4371      8      5  False    False            \(\vee_{2}S^{1}\)   
..    ...    ...    ...    ...      ...                          ...   
77  11065      8      6  False    False            \(\vee_{2}S^{2}\)   
78  11074      8      5  False     True                 Contractible   
79  11076      8      5  False     True                 Contractible   
80  11082      8      5  False    False                    \(S^{2}\)   
81  11112      8      6  False    False                    \(S^{3}\)   

                          HT KG  
0   \(\vee_{2}S^{1}\vee S^{3}\)  
1             \(\vee_{2}S^{1}\)  
2             \(\vee_{2}S^{1}\)  
3             \(\vee_{2}S^{1}\)  
4             \(\vee_{2}S^{1}\)  
..                          ...  
77            \(\vee_{2}S^{3}\)  
78                 Contractible  
79                 Contractible  
80                    \(S^{2}\)  
81                    \(S^{7}\)  

[82 rows x 7 columns]
#+end_example

#+begin_src jupyter-python
homsk = df['HT KG']
homsk
#+end_src

#+RESULTS[a1035d3b2bd656373867cd8550f5c099529ac347]:
#+begin_example
0     \(\vee_{2}S^{1}\vee S^{3}\)
1               \(\vee_{2}S^{1}\)
2               \(\vee_{2}S^{1}\)
3               \(\vee_{2}S^{1}\)
4               \(\vee_{2}S^{1}\)
                 ...             
77              \(\vee_{2}S^{3}\)
78                   Contractible
79                   Contractible
80                      \(S^{2}\)
81                      \(S^{7}\)
Name: HT KG, Length: 82, dtype: object
#+end_example

#+begin_src jupyter-python
homsk[80]
#+end_src

#+RESULTS[f48c01bbac87e623776e56e8dd1d697e7a225ff7]:
: \(S^{2}\)

#+begin_src jupyter-python
df.loc[78]
#+end_src

#+RESULTS[62ad203d13357b3f2cfe1961f265555387a8de29]:
: index             11074
: order                 8
: max d                 5
: Helly             False
: K Helly            True
: HT G       Contractible
: HT KG      Contractible
: Name: 78, dtype: object

#+begin_src jupyter-python
df.dtypes
#+end_src

#+RESULTS[0bf6dfb3add0d5e60ea1387ef147498d7b12a2d1]:
: index       int64
: order       int64
: max d       int64
: Helly        bool
: K Helly      bool
: HT G       object
: HT KG      object
: dtype: object




* COMMENT Local Variables

# Local Variables:
# org-confirm-babel-evaluate: nil
# End:
